#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

void charr (int n, char ch[]){ //Створити одномірний масив символів і заповнити його символами, які вводить користувач.
    int i;
    puts("Array:");
    for (i = 0; i < n; i++){
        printf("%c ", ch[i]);
    }
}

void changeontab(int n, char ch[]){ //Замінити всі цифрові символи у масиві символів на пробіли, вивести елементи масиву символів через кому.
    int i;
    for (i  = 0; i < n; i++){
        if (isdigit(ch[i])){
            ch[i] = ' ';
        }
        printf("%c, ",ch[i]);
    }
}

int alfaIndex(int n, char ch[]){ //Знайти індекс першого буквенного символа у масиві.
    int i, index = -1;
    for (i = 0; i < n; i++){
        if (isalpha(ch[n-i])){
            index = n-i;
        }
    }
    return index;
}

int main()
{
    int n = 10;
    char ch[n];
    puts("Enter the symbols:");
    gets(ch);
    if (strlen(ch) < n){
        printf("Incorrect amount of symbols!");
    }
    else{
        //charr(n, ch);
        //changeontab(n, ch);
        //int f1 = alfaIndex(n, ch);
        //printf("%i", f1);
    }
    return 0;
}

/*
У масиві символів замінити всі букви у нижньому регістрі у верхній регістр, а всі цифрові символи замінити на обернені (9 - цифра, наприклад, якщо символ '3', то замінити його на 9 - 3 = '6').Поміняти місцями перший буквенний і перший цифровий символ у масиві символів.
Заданий масив символів. Перемістити всі буквенні символи на початок масиву, потім всі цифрові символи, а у кінці всі інші символи. Вивести результуючий масив у консолі.
Заданий масив символів і окремий символ. Визначити чи міститься хоча б раз окремий символ у масиві символів.
*/
